# Parameter Property (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..Parameter Property (String)
FamilyManager Class See Also
---
Obtains the parameter of this type with a given name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyParameter this[
	string parameterName
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Parameter ( _
	parameterName As String _
) As FamilyParameter
	Get
```

Visual C++
---
```text
public:
property FamilyParameter^ Parameter[String^ parameterName] {
	FamilyParameter^ get (String^ parameterName);
}
```

# ### Parameters
parameterName
    Type: System..::..String
# Remarks
Returns nullNothingnullptra null reference (Nothing in Visual Basic) if the parameter is not found.
# See Also
FamilyManager Class
Parameter Overload
Autodesk.Revit.DB Namespace